RT-Thread/rt-thread/bsp/gd32/arm/libraries/GD32H7xx_Firmware_Library/GD32H7xx_standard_peripheral/Include/gd32h7xx_sdio.h
/* SDIO receive clock selection */
#define CLKCTL_RECEICECLOCK(regval)     (BITS(20, 21) & ((uint32_t)(regval) << 20))
#define SDIO_RECEIVECLOCK_INCLK         CLKCTL_RECEICECLOCK(0) /*!< select SDIO_IN_CLK clock */
#define SDIO_RECEIVECLOCK_CLKIN         CLKCTL_RECEICECLOCK(1) /*!< select SDIO_CLKIN clock */
#define SDIO_RECEIVECLOCK_FBCLK         CLKCTL_RECEICECLOCK(2) /*!< select SDIO_FB_CLK clock */

/* SDIO card bus speed control */
#define SDIO_BUSSPEED_LOW               (uint32_t)0x00000000U  /*!< DS, HS, SDR12, SDR25 bus speed */
#define SDIO_BUSSPEED_HIGH              SDIO_CLKCTL_BUSSP      /*!< SDR50, SDR104, DDR50 bus speed */

/* SDIO data rate selection */
#define SDIO_DATA_RATE_SDR              (uint32_t)0x00000000U  /*!< SDR selected */
#define SDIO_DATA_RATE_DDR              SDIO_CLKCTL_DRSEL      /*!< DDR selected */

/* SDIO_CLK clock edge selection */
#define SDIO_SDIOCLKEDGE_RISING         (uint32_t)0x00000000U  /*!< select the rising edge of the SDIOCLK to generate SDIO_CLK */
#define SDIO_SDIOCLKEDGE_FALLING        SDIO_CLKCTL_CLKEDGE    /*!< select the falling edge of the SDIOCLK to generate SDIO_CLK */

/* SDIO_CLK clock dynamic switch on/off for power saving */
#define SDIO_CLOCKPWRSAVE_DISABLE       (uint32_t)0x00000000U  /*!< SDIO_CLK clock is always on */
#define SDIO_CLOCKPWRSAVE_ENABLE        SDIO_CLKCTL_CLKPWRSAV  /*!< SDIO_CLK closed when bus is idle */

/* SDIO card bus mode control */
#define CLKCTL_BUSMODE(regval)          (BITS(14, 15) & ((uint32_t)(regval) << 14))
#define SDIO_BUSMODE_1BIT               CLKCTL_BUSMODE(0)      /*!< 1-bit SDIO card bus mode */
#define SDIO_BUSMODE_4BIT               CLKCTL_BUSMODE(1)      /*!< 4-bit SDIO card bus mode */
#define SDIO_BUSMODE_8BIT               CLKCTL_BUSMODE(2)      /*!< 8-bit SDIO card bus mode */

/* SDIO direction polarity of data and command */
#define SDIO_DIRECTION_SIGNAL_LOW       (uint32_t)0x00000000U  /*!< direction signal is low, the voltage transceiver IOs driven as output */
#define SDIO_DIRECTION_SIGNAL_HIGH      SDIO_PWRCTL_DIRPS      /*!< direction signal is high, the voltage transceiver IOs driven as output */

/* SDIO boot mode */
#define SDIO_BOOTMODE_NORMAL            (uint32_t)0x00000000U  /*!< normal boot mode */
#define SDIO_BOOTMODE_ALTERNATIVE       SDIO_CMDCTL_BOOTMOD    /*!< alternative boot mode */

/* SDIO command response type */
#define CMDCTL_CMDRESP(regval)          (BITS(8, 9) & ((uint32_t)(regval) << 8))
#define SDIO_RESPONSETYPE_NO            CMDCTL_CMDRESP(0)      /*!< no response */
#define SDIO_RESPONSETYPE_SHORT         CMDCTL_CMDRESP(1)      /*!< short response */
#define SDIO_RESPONSETYPE_SHORT_NOCRC   CMDCTL_CMDRESP(2)      /*!< short response without CRC */
#define SDIO_RESPONSETYPE_LONG          CMDCTL_CMDRESP(3)      /*!< long response */

/* command state machine wait type */
#define SDIO_WAITTYPE_NO                (uint32_t)0x00000000U  /*!< not wait interrupt */
#define SDIO_WAITTYPE_INTERRUPT         SDIO_CMDCTL_INTWAIT    /*!< wait interrupt */
#define SDIO_WAITTYPE_DATAEND           SDIO_CMDCTL_WAITDEND   /*!< wait the end of data transfer */

/* command type */
#define SDIO_CMDTYPE_NO                 (uint32_t)0x00000000U  /*!< just a command */
#define SDIO_CMDTYPE_TRANSFER           SDIO_CMDCTL_TREN       /*!< command for transfer */
#define SDIO_CMDTYPE_TRANSFERSTOP       SDIO_CMDCTL_TRSTOP     /*!< commang for stopping transfer */
#define SDIO_CMDTYPE_SUSPEND            SDIO_CMDCTL_CMDSR      /*!< suspend command, or resume command */

/* short response and each part of the long response */
#define SDIO_RESPONSE0                  (uint32_t)0x00000000U  /*!< card response[31:0]/card response[127:96] */
#define SDIO_RESPONSE1                  (uint32_t)0x00000001U  /*!< card response[95:64] */
#define SDIO_RESPONSE2                  (uint32_t)0x00000002U  /*!< card response[63:32] */
#define SDIO_RESPONSE3                  (uint32_t)0x00000003U  /*!< card response[31:1], plus bit 0 */

/* SDIO data block size */
#define DATACTL_BLKSZ(regval)           (BITS(4,7) & ((uint32_t)(regval) << 4))
#define SDIO_DATABLOCKSIZE_1BYTE        DATACTL_BLKSZ(0)       /*!< block size = 1 byte */
#define SDIO_DATABLOCKSIZE_2BYTES       DATACTL_BLKSZ(1)       /*!< block size = 2 bytes */
#define SDIO_DATABLOCKSIZE_4BYTES       DATACTL_BLKSZ(2)       /*!< block size = 4 bytes */
#define SDIO_DATABLOCKSIZE_8BYTES       DATACTL_BLKSZ(3)       /*!< block size = 8 bytes */
#define SDIO_DATABLOCKSIZE_16BYTES      DATACTL_BLKSZ(4)       /*!< block size = 16 bytes */
#define SDIO_DATABLOCKSIZE_32BYTES      DATACTL_BLKSZ(5)       /*!< block size = 32 bytes */
#define SDIO_DATABLOCKSIZE_64BYTES      DATACTL_BLKSZ(6)       /*!< block size = 64 bytes */
#define SDIO_DATABLOCKSIZE_128BYTES     DATACTL_BLKSZ(7)       /*!< block size = 128 bytes */
#define SDIO_DATABLOCKSIZE_256BYTES     DATACTL_BLKSZ(8)       /*!< block size = 256 bytes */
#define SDIO_DATABLOCKSIZE_512BYTES     DATACTL_BLKSZ(9)       /*!< block size = 512 bytes */
#define SDIO_DATABLOCKSIZE_1024BYTES    DATACTL_BLKSZ(10)      /*!< block size = 1024 bytes */
#define SDIO_DATABLOCKSIZE_2048BYTES    DATACTL_BLKSZ(11)      /*!< block size = 2048 bytes */
#define SDIO_DATABLOCKSIZE_4096BYTES    DATACTL_BLKSZ(12)      /*!< block size = 4096 bytes */
#define SDIO_DATABLOCKSIZE_8192BYTES    DATACTL_BLKSZ(13)      /*!< block size = 8192 bytes */
#define SDIO_DATABLOCKSIZE_16384BYTES   DATACTL_BLKSZ(14)      /*!< block size = 16384 bytes */

/* SDIO data transfer mode */
#define DATACTL_TRANSMODE(regval)       (BITS(2,3) & ((uint32_t)(regval) << 2))
#define SDIO_TRANSMODE_BLOCKCOUNT       DATACTL_TRANSMODE(0)   /*!< block count data transfer */
#define SDIO_TRANSMODE_MULTIBYTE        DATACTL_TRANSMODE(1)   /*!< multibyte data transfer (only SD/SD I/O) */
#define SDIO_TRANSMODE_STREAM           DATACTL_TRANSMODE(2)   /*!< stream transfer (only eMMC) */
#define SDIO_TRANSMODE_BLOCKCMD12       DATACTL_TRANSMODE(3)   /*!< block data transfer ends with CMD12 */

/* SDIO data transfer direction */
#define SDIO_TRANSDIRECTION_TOCARD      (uint32_t)0x00000000U  /*!< write data to card */
#define SDIO_TRANSDIRECTION_TOSDIO      SDIO_DATACTL_DATADIR   /*!< read data from card */

/* SDIO idma buffer mode */
#define SDIO_IDMA_SINGLE_BUFFER         (uint32_t)0x00000000U  /*!< single buffer mode */
#define SDIO_IDMA_DOUBLE_BUFFER         SDIO_IDMACTL_BUFMOD    /*!< double buffer mode */

/* SDIO idma buffer selection */
#define SDIO_IDMA_BUFFER0               (uint32_t)0x00000000U  /*!< select buffer0 */
#define SDIO_IDMA_BUFFER1               SDIO_IDMACTL_BUFSEL    /*!< select buffer1 */

/* constants definitions */
/* SDIO flags */
#define SDIO_FLAG_CCRCERR               BIT(0)                 /*!< command response received (CRC check failed) flag */
#define SDIO_FLAG_DTCRCERR              BIT(1)                 /*!< data block sent/received (CRC check failed) flag */
#define SDIO_FLAG_CMDTMOUT              BIT(2)                 /*!< command response timeout flag */
#define SDIO_FLAG_DTTMOUT               BIT(3)                 /*!< data timeout flag */
#define SDIO_FLAG_TXURE                 BIT(4)                 /*!< transmit FIFO underrun error occurs flag */
#define SDIO_FLAG_RXORE                 BIT(5)                 /*!< received FIFO overrun error occurs flag */
#define SDIO_FLAG_CMDRECV               BIT(6)                 /*!< command response received (CRC check passed) flag */
#define SDIO_FLAG_CMDSEND               BIT(7)                 /*!< command sent (no response required) flag */
#define SDIO_FLAG_DTEND                 BIT(8)                 /*!< data end (data counter, SDIO_DATACNT is zero) flag */
#define SDIO_FLAG_DTHOLD                BIT(9)                 /*!< data transfer hold flag */
#define SDIO_FLAG_DTBLKEND              BIT(10)                /*!< data block sent/received (CRC check passed) flag */
#define SDIO_FLAG_DTABORT               BIT(11)                /*!< data transfer aborted by CMD12 flag */
#define SDIO_FLAG_CMDSTA                BIT(12)                /*!< command path active state flag */
#define SDIO_FLAG_DATSTA                BIT(13)                /*!< data path active state flag */
#define SDIO_FLAG_TFH                   BIT(14)                /*!< transmit FIFO is half empty flag: at least 8 words can be written into the FIFO */
#define SDIO_FLAG_RFH                   BIT(15)                /*!< receive FIFO is half full flag: at least 8 words can be read in the FIFO */
#define SDIO_FLAG_TFF                   BIT(16)                /*!< transmit FIFO is full flag */
#define SDIO_FLAG_RFF                   BIT(17)                /*!< receive FIFO is full flag */
#define SDIO_FLAG_TFE                   BIT(18)                /*!< transmit FIFO is empty flag */
#define SDIO_FLAG_RFE                   BIT(19)                /*!< receive FIFO is empty flag */
#define SDIO_FLAG_DAT0BSY               BIT(20)                /*!< DAT0 line signal keep busy flag */
#define SDIO_FLAG_DAT0BSYEND            BIT(21)                /*!< DAT0 line signal changed from busy to ready flag */
#define SDIO_FLAG_SDIOINT               BIT(22)                /*!< SD I/O interrupt received flag */
#define SDIO_FLAG_ACKFAIL               BIT(23)                /*!< boot acknowledgment received and check fail flag */
#define SDIO_FLAG_ACKTO                 BIT(24)                /*!< boot acknowledgment timeout flag */
#define SDIO_FLAG_VOLSWEND              BIT(25)                /*!< voltage switch critical timing section end flag */
#define SDIO_FLAG_CLKSTOP               BIT(26)                /*!< SDIO_CLK stopped in voltage switch procedure flag */
#define SDIO_FLAG_IDMAERR               BIT(27)                /*!< IDMA transfer error flag */
#define SDIO_FLAG_IDMAEND               BIT(28)                /*!< IDMA transfer end flag */

/* SDIO interrupt enable or disable */
#define SDIO_INT_CCRCERR                BIT(0)                 /*!< SDIO CCRCERR interrupt */
#define SDIO_INT_DTCRCERR               BIT(1)                 /*!< SDIO DTCRCERR interrupt */
#define SDIO_INT_CMDTMOUT               BIT(2)                 /*!< SDIO CMDTMOUT interrupt */
#define SDIO_INT_DTTMOUT                BIT(3)                 /*!< SDIO DTTMOUT interrupt */
#define SDIO_INT_TXURE                  BIT(4)                 /*!< SDIO TXURE interrupt */
#define SDIO_INT_RXORE                  BIT(5)                 /*!< SDIO RXORE interrupt */
#define SDIO_INT_CMDRECV                BIT(6)                 /*!< SDIO CMDRECV interrupt */
#define SDIO_INT_CMDSEND                BIT(7)                 /*!< SDIO CMDSEND interrupt */
#define SDIO_INT_DTEND                  BIT(8)                 /*!< SDIO DTEND interrupt */
#define SDIO_INT_DTHOLD                 BIT(9)                 /*!< SDIO DTHOLD interrupt */
#define SDIO_INT_DTBLKEND               BIT(10)                /*!< SDIO DTBLKEND interrupt */
#define SDIO_INT_DTABORT                BIT(11)                /*!< SDIO DTABORT interrupt */
#define SDIO_INT_TFH                    BIT(14)                /*!< SDIO TFH interrupt */
#define SDIO_INT_RFH                    BIT(15)                /*!< SDIO RFH interrupt */
#define SDIO_INT_RFF                    BIT(17)                /*!< SDIO RFF interrupt */
#define SDIO_INT_TFE                    BIT(18)                /*!< SDIO TFE interrupt */
#define SDIO_INT_DAT0BSYEND             BIT(21)                /*!< SDIO DAT0BSYEND interrupt */
#define SDIO_INT_SDIOINT                BIT(22)                /*!< SDIO SDIOINT interrupt */
#define SDIO_INT_ACKFAIL                BIT(23)                /*!< SDIO ACKFAIL interrupt */
#define SDIO_INT_ACKTO                  BIT(24)                /*!< SDIO ACKTO interrupt */
#define SDIO_INT_VOLSWEND               BIT(25)                /*!< SDIO VOLSWEND interrupt */
#define SDIO_INT_CLKSTOP                BIT(26)                /*!< SDIO CLKSTOP interrupt */
#define SDIO_INT_IDMAERR                BIT(27)                /*!< SDIO IDMAERR interrupt */
#define SDIO_INT_IDMAEND                BIT(28)                /*!< SDIO IDMAEND interrupt */

